In [1]:
import numpy as np
import pandas as pd

In [2]:
import matplotlib.pyplot as plt
import seaborn as sns
color = sns.color_palette()

%matplotlib inline

In [3]:
import sys
sys.path.insert(0, '/Users/mrahimi/AVM/module/')
import Plot
pl = Plot.Plot()
import sql2pd

In [23]:
query = """SELECT cu.customer_id, cu.customer_date, cl.client_date, cl.client_id, cl.lr_website_name, cl.metro, cl.LR_LEAD_ACCEPT_DATE, cl.LR_LEAD_CREATE_DATE, cu.application_id FROM
    (SELECT customer_id, create_date AS customer_date, application_id FROM customer
     WHERE create_date > TO_DATE('01-JAN-15') AND create_date < TO_DATE('01-JAN-18')
    ) CU
JOIN
    (SELECT customer_id, client_id, create_date AS client_date, lr_website_name, lr_source_name, metro, LR_LEAD_ACCEPT_DATE, LR_LEAD_CREATE_DATE FROM client_agent
    WHERE create_date > TO_DATE('01-JAN-15') AND create_date < TO_DATE('01-JAN-18')
    ) CL
ON cu.customer_id = cl.customer_id
WHERE 
UPPER(lr_website_name) NOT LIKE '%ZAP%' AND
UPPER(lr_source_name) NOT LIKE '%ZAP%' AND
lr_website_name != 'Century21.com' AND
lr_website_name != '*Custom Company' AND 
lr_website_name != 'ColdwellBanker.com' AND
lr_website_name != 'BHGRealEstate.com' AND
lr_website_name != 'Century21 Mobile' AND
lr_website_name != 'ERA.com' AND
lr_website_name != 'DotSignal Text ERA'"""

In [28]:
query = """SELECT cu.customer_id, cu.customer_date, cl.client_date, cl.client_id, cl.lr_website_name, cl.metro, cl.LR_LEAD_ACCEPT_DATE, cl.LR_LEAD_CREATE_DATE, cu.application_id FROM
    (SELECT customer_id, create_date AS customer_date, application_id FROM customer
    ) CU
JOIN
    (SELECT customer_id, client_id, create_date AS client_date, lr_website_name, lr_source_name, metro, LR_LEAD_ACCEPT_DATE, LR_LEAD_CREATE_DATE FROM client_agent
    ) CL
ON cu.customer_id = cl.customer_id
WHERE 
UPPER(lr_website_name) NOT LIKE '%ZAP%' AND
UPPER(lr_source_name) NOT LIKE '%ZAP%' AND
lr_website_name != 'Century21.com' AND
lr_website_name != '*Custom Company' AND 
lr_website_name != 'ColdwellBanker.com' AND
lr_website_name != 'BHGRealEstate.com' AND
lr_website_name != 'Century21 Mobile' AND
lr_website_name != 'ERA.com' AND
lr_website_name != 'DotSignal Text ERA'"""

In [29]:
df = sql2pd.stby_query(select=(query), file_name = "customer_client3.csv")

The query took 1199.13 seconds (19.99 minutes).

The query returned 2430368 rows. 	 shape:  (2430368, 9)

Results were saved to customer_client3.csv

The following select statement was executed:
 SELECT cu.customer_id, cu.customer_date, cl.client_date, cl.client_id, cl.lr_website_name, cl.metro, cl.LR_LEAD_ACCEPT_DATE, cl.LR_LEAD_CREATE_DATE, cu.application_id FROM
    (SELECT customer_id, create_date AS customer_date, application_id FROM customer
    ) CU
JOIN
    (SELECT customer_id, client_id, create_date AS client_date, lr_website_name, lr_source_name, metro, LR_LEAD_ACCEPT_DATE, LR_LEAD_CREATE_DATE FROM client_agent
    ) CL
ON cu.customer_id = cl.customer_id
WHERE
UPPER(lr_website_name) NOT LIKE '%ZAP%' AND
UPPER(lr_source_name) NOT LIKE '%ZAP%' AND
lr_website_name != 'Century21.com' AND
lr_website_name != '*Custom Company' AND
lr_website_name != 'ColdwellBanker.com' AND
lr_website_name != 'BHGRealEstate.com' AND
lr_website_name != 'Century21 Mobile' AND
lr_website_name != 'ERA.com' AND
lr_website_name != 'DotSignal Text ERA'

The following columns were returned:
 ['CUSTOMER_ID', 'CUSTOMER_DATE', 'CLIENT_DATE', 'CLIENT_ID', 'LR_WEBSITE_NAME', 'METRO', 'LR_LEAD_ACCEPT_DATE', 'LR_LEAD_CREATE_DATE', 'APPLICATION_ID']

In [30]:
query = """SELECT cu.customer_id, cu.customer_date, cl.client_date, cl.client_id, cl.lr_website_name, cl.metro, cl.LR_LEAD_ACCEPT_DATE, cl.LR_LEAD_CREATE_DATE, cu.application_id FROM
    (SELECT customer_id, create_date AS customer_date, application_id FROM customer
    ) CU
JOIN
    (SELECT customer_id, client_id, create_date AS client_date, lr_website_name, lr_source_name, metro, LR_LEAD_ACCEPT_DATE, LR_LEAD_CREATE_DATE FROM client_agent
    ) CL
ON cu.customer_id = cl.customer_id
"""

In [31]:
df = sql2pd.stby_query(select=(query), file_name = "customer_client4.csv")

The query took 5678.59 seconds (94.64 minutes).

The query returned 11905988 rows. 	 shape:  (11905988, 9)

Results were saved to customer_client4.csv

The following select statement was executed:
 SELECT cu.customer_id, cu.customer_date, cl.client_date, cl.client_id, cl.lr_website_name, cl.metro, cl.LR_LEAD_ACCEPT_DATE, cl.LR_LEAD_CREATE_DATE, cu.application_id FROM
    (SELECT customer_id, create_date AS customer_date, application_id FROM customer
    ) CU
JOIN
    (SELECT customer_id, client_id, create_date AS client_date, lr_website_name, lr_source_name, metro, LR_LEAD_ACCEPT_DATE, LR_LEAD_CREATE_DATE FROM client_agent
    ) CL
ON cu.customer_id = cl.customer_id


The following columns were returned:
 ['CUSTOMER_ID', 'CUSTOMER_DATE', 'CLIENT_DATE', 'CLIENT_ID', 'LR_WEBSITE_NAME', 'METRO', 'LR_LEAD_ACCEPT_DATE', 'LR_LEAD_CREATE_DATE', 'APPLICATION_ID']

In [10]:
df.head()

,CUSTOMER_ID,CUSTOMER_DATE,CLIENT_DATE,CLIENT_ID,LR_WEBSITE_NAME,METRO,LR_LEAD_ACCEPT_DATE,LR_LEAD_CREATE_DATE,APPLICATION_ID
0,26599419,2017-03-08 16:49:52,2017-03-08 16:49:52,31383695,HotPads.com,grand-rapids-mi,NaT,2017-03-08 16:48:03,7
1,26599499,2017-03-08 16:55:42,2017-03-08 16:55:42,31383779,Realtor.com,middlesex-county-nj,2017-03-08 19:55:38,2017-03-08 16:23:57,4
2,26599613,2017-03-08 17:07:32,2017-03-08 17:07:32,31383919,Realtor.com,sheridan-wy,2017-03-08 20:07:23,2017-03-08 17:03:47,8
3,26599615,2017-03-08 17:07:32,2017-03-08 17:07:32,31383921,Zillow.com,palmbeach,NaT,2017-03-08 16:30:10,9
4,26242967,2017-02-15 07:38:44,2017-03-08 17:08:32,31383945,Realtor.com,boston,2017-03-08 20:08:24,2017-03-08 17:06:33,8

In [4]:
query = """ SELECT MIN(time_logged_in) AS time_in, client_id FROM session_log
            WHERE time_logged_in > TO_DATE('01-JAN-17')
            group by client_id """

In [5]:
dt = sql2pd.stby_query(select=(query), file_name = "login.csv")

The query took 2613.62 seconds (43.56 minutes).

The query returned 5367051 rows. 	 shape:  (5367051, 2)

Results were saved to login.csv

The following select statement was executed:
  SELECT MIN(time_logged_in) AS time_in, client_id FROM session_log
            WHERE time_logged_in > TO_DATE('01-JAN-17')
            group by client_id

The following columns were returned:
 ['TIME_IN', 'CLIENT_ID']

In [6]:
query = """ select listing_num, source, listing_price, listing_date, home_sq_feet, zip, 
          property_type, bedrooms, full_baths, year_built, state, city, latitude, longitude from bdr.mls_listing_inactive """

In [7]:
dm = sql2pd.stby_query(select=(query), file_name = "ca_ba_inactive.csv")

The query took 6466.88 seconds (107.78 minutes).

The query returned 8738713 rows. 	 shape:  (8738713, 14)

Results were saved to ca_ba_inactive.csv

The following select statement was executed:
  select listing_num, source, listing_price, listing_date, home_sq_feet, zip,
          property_type, bedrooms, full_baths, year_built, state, city, latitude, longitude from bdr.mls_listing_inactive

The following columns were returned:
 ['LISTING_NUM', 'SOURCE', 'LISTING_PRICE', 'LISTING_DATE', 'HOME_SQ_FEET', 'ZIP', 'PROPERTY_TYPE', 'BEDROOMS', 'FULL_BATHS', 'YEAR_BUILT', 'STATE', 'CITY', 'LATITUDE', 'LONGITUDE']

In [4]:
query = """ select listing_num, source, listing_price, listing_date, home_sq_feet, zip, 
          property_type, bedrooms, full_baths, year_built, state, city, latitude, longitude from bdr.mls_listing """

In [5]:
dm = sql2pd.stby_query(select=(query), file_name = "ca_ba_active.csv")

The query took 435.44 seconds (7.26 minutes).

The query returned 923381 rows. 	 shape:  (923381, 14)

Results were saved to ca_ba_active.csv

The following select statement was executed:
  select listing_num, source, listing_price, listing_date, home_sq_feet, zip,
          property_type, bedrooms, full_baths, year_built, state, city, latitude, longitude from bdr.mls_listing

The following columns were returned:
 ['LISTING_NUM', 'SOURCE', 'LISTING_PRICE', 'LISTING_DATE', 'HOME_SQ_FEET', 'ZIP', 'PROPERTY_TYPE', 'BEDROOMS', 'FULL_BATHS', 'YEAR_BUILT', 'STATE', 'CITY', 'LATITUDE', 'LONGITUDE']

In [20]:
dm.head()

,LISTING_NUM,SOURCE,LISTING_PRICE,LISTING_DATE,HOME_SQ_FEET,ZIP,PROPERTY_TYPE,BEDROOMS,FULL_BATHS,YEAR_BUILT,STATE,CITY,PROPERTY_TYPE
0,18018383,MFMLS,314444,NaT,1247.0,95667,SFR,4,2,1997.0,CA,Placerville,SFR
1,21724570,CABAREIS,729000,2017-10-19,2564.0,94510,SFR,5,3,1969.0,CA,Benicia,SFR
2,17055107,MFMLS,930000,NaT,3504.0,95762,SFR,4,3,1992.0,CA,El Dorado Hills,SFR
3,21728361,CABAREIS,1348000,2017-12-19,2200.0,95404,SFR,3,2,1890.0,CA,Santa Rosa,SFR
4,133281,CA_TCMLS,425000,2017-09-17,2100.0,93265,SFR,3,0,1985.0,CA,Ponderosa,SFR

In [8]:
query = """ SELECT al.client_id, al.listing_num, al.postal_code, al.mls_source, al.client_notes FROM
    (SELECT client_id, MIN(create_date) AS home_date FROM home_info_request
    WHERE create_date > TO_DATE('01-JAN-17') 
    GROUP BY CLIENT_ID) cl
    
    LEFT JOIN
    
    (SELECT * FROM home_info_request) al
    on cl.client_id = al.client_id AND cl.home_date = al.create_date """

In [9]:
di = sql2pd.stby_query(select=(query), file_name = "home_info.csv")

The query took 1196.93 seconds (19.95 minutes).

The query returned 2144435 rows. 	 shape:  (2144435, 5)

Results were saved to home_info.csv

The following select statement was executed:
  SELECT al.client_id, al.listing_num, al.postal_code, al.mls_source, al.client_notes FROM
    (SELECT client_id, MIN(create_date) AS home_date FROM home_info_request
    WHERE create_date > TO_DATE('01-JAN-17')
    GROUP BY CLIENT_ID) cl

    LEFT JOIN

    (SELECT * FROM home_info_request) al
    on cl.client_id = al.client_id AND cl.home_date = al.create_date

The following columns were returned:
 ['CLIENT_ID', 'LISTING_NUM', 'POSTAL_CODE', 'MLS_SOURCE', 'CLIENT_NOTES']